40/data/attachments/e77d096fe0409bf.txt

URL: http://www.advantageonlineshopping.com:80/accountservice/ws
SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>WpZEv</com:loginUser>
            <com:email>WpZEv@email.com</com:email>
            <com:loginPassword>Ssenr120</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>
SOAP Response: 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:AccountLoginResponse xmlns:ns2="com.advantage.online.store.accountservice">
            <ns2:StatusMessage>
                <ns2:success>true</ns2:success>
                <ns2:userId>558663568</ns2:userId>
                <ns2:reason>Login Successful</ns2:reason>
                <ns2:token>eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJ3d3cuYWR2YW50YWdlb25saW5lc2hvcHBpbmcuY29tIiwidXNlcklkIjo1NTg2NjM1NjgsInN1YiI6IldwWkV2Iiwicm9sZSI6IlVTRVIifQ.lrXpJOxKUFA14Rk7vAsOrbBMt4PEaIHwZFHrMYHH434</ns2:token>
                <ns2:sessionId>199946d5580@7E991D72B25^i%558663568</ns2:sessionId>
                <ns2:t_authorization>V3BaRXY6U3NlbnIxMjA=</ns2:t_authorization>
                <ns2:accountType>20</ns2:accountType>
            </ns2:StatusMessage>
        </ns2:AccountLoginResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
